st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Projects/STM32F072RB-Nucleo/Applications/USB_PD/Provider_CLI_RTOS/Src/usbpd_dpm.c
    /* Case Received Sink PDO values Data information :
    */
    case USBPD_CORE_DATATYPE_RCV_SNK_PDO :
      if (Size <= USBPD_MAX_NB_PDO)
      {
        DPM_Ports[PortNum].DPM_NumberOfRcvSNKPDO = Size;
        /* Copy PDO data in DPM Handle field */
        for (index = 0; index < Size; index++)
        {
          DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] = LE32(Ptr + index);
        }
      }
      break;

    /* Case Received Request PDO Data information :
    */
    case USBPD_CORE_DATATYPE_RCV_REQ_PDO :
      if (Size == 1)
      {
        DPM_Ports[PortNum].DPM_RcvRequestDOMsg = *Ptr;
      }
      break;

    /* Case RRequest message DO (from Sink to Source) Data information :
    */
    case USBPD_CORE_DATATYPE_REQUEST_DO :
      if (Size == 1)
      {
        DPM_Ports[PortNum].DPM_RcvRequestDOMsg = *Ptr;
      }
      break;

    /* In case of unexpected data type (Set request could not be fulfilled) :
    */
    default :
      break;
  }
}

/**
  * @brief  Evaluate received Request Message from Sink port  
  * @param  pdhandle Pointer to USB PD handle
  * @retval USBPD status
  */
static USBPD_StatusTypeDef USBPD_DPM_EvaluateRequest(uint8_t PortNum)
{
  uint32_t rdo = 0, pdo = 0, pdomaxcurrent = 0;
  uint32_t rdomaxcurrent = 0, rdoopcurrent = 0, rdoobjposition = 0;
  USBPD_HandleTypeDef *pdhandle = &DPM_Ports[PortNum];

  rdo = pdhandle->DPM_RcvRequestDOMsg;
  rdomaxcurrent = rdo & 0x3FF;
  rdoopcurrent = (rdo >> 10) & 0x3FF;
  rdoobjposition = (rdo >> 28) & 0x7;
  pdhandle->DPM_RDOPosition = 0;
  
  /* Check if RDP can be met within the supported PDOs by the Source port */
  USBPD_UsrLog("USBPD_DPM_EvaluateRequest: Evaluate Sink Request\r");
  USBPD_UsrLog("USBPD_DPM_EvaluateRequest: Check if RDP can be met within the supported PDOs by the Source port\r");
  
  /* Search PDO in Port Source PDO list, that corresponds to Position provided in Request RDO */
  if (USBPD_PWR_IF_SearchRequestedPDO(PortNum, rdoobjposition, &pdo) != USBPD_OK)
  {
    /* Invalid PDO index */
    USBPD_ErrLog("USBPD_DPM_EvaluateRequest: Invalid PDOs index\r");
    return USBPD_FAIL;
  }

  pdomaxcurrent = (pdo & 0x3FF);
  
  if(rdoopcurrent > pdomaxcurrent)
  {
    /* Sink requests too much operating current */
    USBPD_ErrLog("USBPD_DPM_EvaluateRequest: Sink requests too much operating current\r");
    return USBPD_FAIL;
  }

  if(rdomaxcurrent > pdomaxcurrent)
  {
    /* Sink requests too much maximum operating current */
    USBPD_ErrLog("USBPD_DPM_EvaluateRequest: Sink requests too much maximum operating current\r");
    return USBPD_FAIL;
  }

  /* Set RDO position and requested voltage in DPM port structure */
  pdhandle->DPM_RequestedVoltage = ((pdo >> 10) & 0x3ff) * 50;
  pdhandle->DPM_RDOPosition = rdoobjposition;

  /* Accept the requested power */
  USBPD_UsrLog("USBPD_DPM_EvaluateRequest: Sink requested %d mV %d mA for operating current from %d to %d mA\r",
               ((pdo >> 10) & 0x3ff) * 50, (pdo & 0x3ff) * 10,
               ((rdo >> 10) & 0x3ff) * 10, (rdo & 0x3ff) * 10);
  USBPD_UsrLog("USBPD_DPM_EvaluateRequest: Source accepts the requested power\r");

  return USBPD_OK;
}


/**
  * @brief  Evaluate received Capabilities Message from Source port and prepare the request message  
  * @param  PortNum Port number
  * @retval USBPD status
  */
static USBPD_StatusTypeDef USBPD_DPM_EvaluateCapabilities(uint8_t PortNum)
{
  uint32_t mv = 0, mw = 0, ma = 0, pdo;
  USBPD_SNKBatteryRDO_TypeDef rdpbattery;
  USBPD_SNKFixedVariableRDO_TypeDef rdpfixed;
  USBPD_HandleTypeDef *pdhandle = &DPM_Ports[PortNum];
  int32_t pdoindex = 0;
  
  pdhandle->DPM_RequestedVoltage = 0;
  
  USBPD_UsrLog("USBPD_DPM_EvaluateCapabilities: Port Partner Requests Max Voltage\r");
  
  /* Find the Pdo index for the requested voltage */    	
  pdoindex = DPM_FindVoltageIndex(PortNum, &(pdhandle->DPM_SNKRequestedPower));
  
  /* If could not find desired pdo index, then return error */
  if (pdoindex == -1)
  {
    USBPD_ErrLog("PE_EvaluateCapability: could not find desired voltage\r");
    
    rdpfixed.d32 = 0;
    rdpfixed.b.ObjectPosition = 1;
    rdpfixed.b.OperatingCurrentIn10mAunits =  pdhandle->DPM_SNKRequestedPower.MaxOperatingCurrentInmAunits / 10;
    rdpfixed.b.MaxOperatingCurrent10mAunits = pdhandle->DPM_SNKRequestedPower.MaxOperatingCurrentInmAunits / 10;
    rdpfixed.b.CapabilityMismatch = 1;
    USBPD_UsrLog("USBPD_DPM_EvaluateCapabilities: Mismatch, could not find desired pdo index\r");
    
    pdhandle->DPM_RequestDOMsg = rdpfixed.d32;
    return USBPD_ERROR;
  }
  
  /* Extract power information from Power Data Object */
  USBPD_UsrLog("USBPD_DPM_EvaluateCapabilities: Extract power information from Power Data Object\r");
  
  pdo = pdhandle->DPM_ListOfRcvSRCPDO[pdoindex];
  
  mv = ((pdo >> 10) & 0x3FF) * 50; /* mV */
  if((pdo & USBPD_PDO_TYPE_Msk) == USBPD_PDO_TYPE_BATTERY) 
  {
    mw = (pdo & 0x3FF) * 250; /* mW */
    mw = USBPD_MIN(mw, pdhandle->DPM_SNKRequestedPower.MaxOperatingPowerInmWunits); /* mW */
    ma = mw/mv; /* mA */
  }
  else
  {
    ma = (pdo & 0x3FF) * 10; /* mA */
  }
  ma = USBPD_MIN(ma, pdhandle->DPM_SNKRequestedPower.MaxOperatingCurrentInmAunits);
  mw = ma * mv; /* mW */
  
  if((pdo & USBPD_PDO_TYPE_Msk) == USBPD_PDO_TYPE_BATTERY) 
  {
    rdpbattery.d32 = 0;
    rdpbattery.b.ObjectPosition = pdoindex + 1;
    rdpbattery.b.OperatingPowerIn250mWunits = mw / 250;
    rdpbattery.b.MaxOperatingPowerIn250mWunits = mw / 250; 
    if(mw < pdhandle->DPM_SNKRequestedPower.OperatingPowerInmWunits)
    {
      rdpbattery.b.CapabilityMismatch = 1;
      USBPD_UsrLog("USBPD_DPM_EvaluateCapabilities: Mismatch, less power offered than the operating power\r");
    }
    pdhandle->DPM_RequestDOMsg = rdpbattery.d32;
    USBPD_UsrLog("USBPD_DPM_EvaluateCapabilities: Battery Request Data Object %u: %d mW", pdhandle->DPM_RequestDOMsg, mw);
  }
  else
  {
    rdpfixed.d32 = 0;
    rdpfixed.b.ObjectPosition = pdoindex + 1;
    rdpfixed.b.OperatingCurrentIn10mAunits = ma / 10;
    rdpfixed.b.MaxOperatingCurrent10mAunits = ma / 10; 
    if(mw < pdhandle->DPM_SNKRequestedPower.OperatingPowerInmWunits)
    {
      rdpfixed.b.CapabilityMismatch = 1;
      USBPD_UsrLog("USBPD_DPM_EvaluateCapabilities: Mismatch, less power offered than the operating power\r");
    }
    pdhandle->DPM_RequestDOMsg = rdpfixed.d32;
    USBPD_UsrLog("USBPD_DPM_EvaluateCapabilities: Fixed Request Data Object %u: %d mV, %d mA", pdhandle->DPM_RequestDOMsg, mv, ma);
  }
  
